In [52]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [53]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [54]:
%%sql
drop table if exists Trade_tbl;
Create table Trade_tbl(
TRADE_ID varchar(20),
Trade_Timestamp time,
Trade_Stock varchar(20),
Quantity int,
Price Float
);

 * sqlite:///./test.db
Done.
Done.

[]

In [55]:
%%sql
Insert into Trade_tbl Values('TRADE1','10:01:05','ITJunction4All',100,20)
,('TRADE2','10:01:06','ITJunction4All',20,15)
,('TRADE3','10:01:08','ITJunction4All',150,30)
,('TRADE4','10:01:09','ITJunction4All',300,32)
,('TRADE5','10:10:00','ITJunction4All',-100,19)
,('TRADE6','10:10:01','ITJunction4All',-300,19);

 * sqlite:///./test.db
6 rows affected.

[]

In [56]:
%sql select * from trade_tbl

 * sqlite:///./test.db
Done.

[('TRADE1', '10:01:05', 'ITJunction4All', 100, 20.0),
 ('TRADE2', '10:01:06', 'ITJunction4All', 20, 15.0),
 ('TRADE3', '10:01:08', 'ITJunction4All', 150, 30.0),
 ('TRADE4', '10:01:09', 'ITJunction4All', 300, 32.0),
 ('TRADE5', '10:10:00', 'ITJunction4All', -100, 19.0),
 ('TRADE6', '10:10:01', 'ITJunction4All', -300, 19.0)]

SQL to find all couples of trade for same stock that happened in the range of 10 seconds and having price difference by more than 10 %. Output result should also list the percentage of price difference between the 2 trade

In [57]:
%%sql
select TRADE1,TRADE2,round(abs(price2-price1)/price1 * 100,2) price_diff from (
(select TRADE_ID TRADE1,strftime('%s',trade_timestamp) trade_time1,price price1 from trade_tbl) t1
inner join
(select TRADE_ID TRADE2,strftime('%s',trade_timestamp) trade_time2,price price2 from trade_tbl) t2
on t1.trade1<t2.trade2  
)x
where abs(((price2-price1)/price1) * 100) >= 10
and trade_time2-trade_time1<=10

 * sqlite:///./test.db
Done.

[('TRADE1', 'TRADE2', 25.0),
 ('TRADE1', 'TRADE3', 50.0),
 ('TRADE1', 'TRADE4', 60.0),
 ('TRADE2', 'TRADE3', 100.0),
 ('TRADE2', 'TRADE4', 113.33)]